000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ABORT.
000030 AUTHOR.     TCS.
000040 DATE-COMPLIED.24/05/06.
************************************************************************
000060*     ISSUES AN ABEND AND STOPS THE RUN BY CALLING "CANCEL"
************************************************************************
000080 ENVIRONMENT DIVISION.
TOFANN CONFIGURATION SECTION.
TOFANN SOURCE-COMPUTER. IBM-390.
TOFANN OBJECT-COMPUTER.
TOFANN     PROGRAM COLLATING SEQUENCE EBC.
TOFANN SPECIAL-NAMES.
TOFANN     ALPHABET EBC IS EBCDIC.
************************************************************************
000160*     CONVERTED FROM ASSEMBLER ROUTINE ABORT
************************************************************************
000180 DATA DIVISION.
000190 WORKING-STORAGE SECTION.
000200 PROCEDURE DIVISION.
000210     CALL 'CANCEL'
000220     GOBACK.
